#!/usr/bin/python3.7
# -*- coding: utf-8 -*-
# @Author : Sma11New
# @Github : https://github.com/Sma11New

def banner():
    logo = rf"""
                        __    ______         
         _      _____  / /_  / ____/_  _____ 
        | | /| / / _ \/ __ \/ __/ / / / / _ \
        | |/ |/ /  __/ /_/ / /___/ /_/ /  __/
        |__/|__/\___/_.___/_____/\__, /\___/ 
                                /____/     
    Author: Sma11New
    Version: 2.1
    """
    msg = """   多线程Web资产发现工具，目标ip和port支持以下格式，使用","分割指定多个参数：

        -i/--ip 参数支持的格式：
                192.168.1.1/24 
                192.168.1.1-20
                192.168.1.*
                192.168.1-6.*
        -p/--port 参数支持的格式：
                80,443,8080
                1-8080
    Example：
        python3 webEye.py -i 192.168.1.1/24,10.0.0.1-200 -p 80,8080,1000-2000
    """
    print("\033[93m" + logo + "\033[0m")
    print("\033[91m" + msg + "\033[0m")

if __name__ == "__main__":
    banner()
